app/controllers/api/v1/vehicles_controller.rb

SELECT "vehicles".* FROM "vehicles" ORDER BY created_at DESC
---
      def index
      vehicles =Vehicle.order('created_at DESC');

SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      def show
        vehicle = Vehicle.find(params[:id])

INSERT INTO "vehicles" ("placa", "color", "año", "categoria", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["placa", "ABC132"], ["color", "Blanco"], ["año", 1994], ["categoria", 1], ["created_at", "2017-08-11 19:07:36.158063"], ["updated_at", "2017-08-11 19:07:36.158063"]]
---
      def create
        # Creo otro objeto de Vehiculo con el fin de obtener la placa y saber que tipo de categoria es
        #y así poder crear un vehiculo con la categoría según la placa.
        vehicle1 = Vehicle.new
        categoriaN= vehicle1.category(params[:placa])
        añoN=params[:año]
        vehicle = Vehicle.new(:placa=>params[:placa],:color =>params[:color],:categoria=>categoriaN,:año=>añoN.to_i)
        puts(params[:placa])
        if vehicle.save

SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "vehicles" WHERE "vehicles"."id" = ?  [["id", 7]]
---
      def destroy

        vehicle = Vehicle.find(params[:id])
        vehicle.destroy

SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "vehicles" SET "placa" = ?, "color" = ?, "updated_at" = ? WHERE "vehicles"."id" = ?  [["placa", "ABC132"], ["color", "Negro"], ["updated_at", "2017-08-11 19:16:47.969879"], ["id", 1]]
---
      def update
        vehicle =Vehicle.find(params[:id])
        if vehicle.update_attributes(vehicle_params)